Repository: pingfangx/TranslatorX-other
Catalog: Gradle/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Publishing configuration, such as a common group name for the libraries as well as the repository coordinates might be a cross-cutting concern that both libraries need to share.
zh_cn: 发布配置(例如库的公共组名以及存储库坐标)可能是两个库都需要共享的跨领域问题。

source: Publishing these markers is automated by the java-gradle-plugin.
zh_cn: java-gradle-plugin 自动发布这些标记。

source: Publishing your plugin
zh_cn: 发布你的插件

source: Quick Start
zh_cn: 快速开始

source: Rather than using a plugin id, plugins can also be applied by simply specifying the class of the plugin:
zh_cn: 除了使用插件 id，还可以通过简单地指定插件的类来应用插件：

source: Refer to Lazy Configuration for more information.
zh_cn: 有关更多信息，请参阅 Lazy Configuration。

source: Refer to the reference page of the relevant plugin to learn about its default conventions.
zh_cn: 请参阅相关插件的参考页面，了解其默认约定。

source: Reference
zh_cn: 参考

source: Release Notes
zh_cn: 版本说明

source: Remember to run a full build regularly or at least when you’re done, though.
zh_cn: 请记住定期运行完整的构建，或者至少在完成时进行完整的构建。

source: Reuse convention plugins in both main build and build logic build
zh_cn: 在主构建和构建逻辑构建中重用约定插件

source: Running gradle publish in the sample directory creates the following Maven repository layout (the Ivy layout is similar):
zh_cn: 在示例目录中运行 gradle publish 将创建以下 Maven 仓库布局(Ivy 布局类似)：

source: Running Gradle Builds
zh_cn: 运行 Gradle 构建

source: Sample Index
zh_cn: 示例索引

source: Samples
zh_cn: 示例

source: Scala Plugin
zh_cn: Scala 插件

source: Script plugins
zh_cn: 脚本插件

source: Script plugins are additional build scripts that further configure the build and usually implement a declarative approach to manipulating the build.
zh_cn: 脚本插件是进一步配置构建的额外构建脚本，通常实现一种声明性方法来操作构建。

source: Script plugins are automatically resolved and can be applied from a script on the local filesystem or at a remote location.
zh_cn: 脚本插件是自动解析的，可以从本地文件系统或远程位置的脚本应用。

source: Script plugins are self-resolving in that they are resolved from the specific file path or URL provided when applying them.
zh_cn: 脚本插件是自解析的，因为它们是从应用它们时提供的特定文件路径或 URL 解析的。

source: See Organizing Gradle Projects for more details about the buildSrc project.
zh_cn: 有关 buildSrc 项目的更多详细信息，请参阅 Organizing Gradle Projects。

source: See PluginDependenciesSpec for more information on using the Plugin DSL.
zh_cn: 有关使用 plugins DSL 的更多信息，请参阅 PluginDependenciesSpec。

source: See PluginManagementSpec for complete documentation for using the pluginManagement {} block.
zh_cn: 有关使用 pluginManagement {} 块的完整文档，请参见 PluginManagementSpec。

source: See plugin version management if you want to use a variable to define a plugin version.
zh_cn: 如果要使用变量定义插件版本，请参阅插件版本管理。

source: See the Ivy and Maven chapters on publishing artifacts.
zh_cn: 请参阅关于发布库的 Ivy 和 Maven 章节。

source: Separate language-specific source files
zh_cn: 隔离语言特定的源文件

source: Separate source files per test type
zh_cn: 每种测试类型隔离单独的源文件

source: Separated test source code has a positive impact on maintainability and separation of concerns as you can run test types independent from each other.
zh_cn: 分离的测试源代码对可维护性和关注点分离有积极的影响，因为你可以独立运行某种测试类型。

source: Setting up Publishing
zh_cn: 设置发布

source: Shared Build Services
zh_cn: 共享构建服务

source: Sharing Build Logic between Subprojects
zh_cn: 在子项目之间共享构建逻辑

source: Sharing Outputs of Projects
zh_cn: 分享项目输出

source: Sharing Versions
zh_cn: 共享版本

source: Sharing build logic between subprojects Sample
zh_cn: 在子项目之间共享构建逻辑的示例

source: Sharing convention plugins with build logic build Sample
zh_cn: 使用构建逻辑共享约定插件的构建示例

source: Signing Artifacts
zh_cn: 签名产物

source: Similarly, if the plugin was developed at the baz organization, the plugin id might be org.baz.bar.
zh_cn: 类似地，如果插件是在 baz 组织开发的，那么插件 id 可能是 org.baz.bar。

source: Similarly, the Application Plugin applies and configures the Java Plugin and the Distribution Plugin.
zh_cn: 类似地，Application Plugin 应用并配置 Java Plugin 和 Distribution Plugin。

source: Since the plugins {} DSL block only allows for declaring plugins by their globally unique plugin id and version properties, Gradle needs a way to look up the coordinates of the plugin implementation artifact.
zh_cn: 由于 plugins {}DSL 块只允许通过其全局唯一的插件 id 和 version 属性来声明插件，Gradle 需要一种方法来查找插件实现库的坐标。

source: Since this is such a common use case, it’s recommended that build authors use the plugins DSL to both resolve and apply plugins in one step.
zh_cn: 由于这是一个非常常见的用例，因此建议使用 plugins DSL 在一步中实现解析和应用插件。

source: So how does Gradle find the Plugin implementation?
zh_cn: 那么 Gradle 是如何找到 Plugin 实现的呢？

source: Some compilers are capable of cross-compiling multiple languages in the same source directory.
zh_cn: 有些编译器能够在同一源目录中交叉编译多种语言。

source: Some other code subprojects may be dedicated for testing purposes and so on.
zh_cn: 其他一些 代码 子项目可以专用于 测试目的 等。

source: Source code and build logic of every software project should be organized in a meaningful way.
zh_cn: 每个软件项目的源代码和构建逻辑都应该以一种有意义的方式组织起来。

source: SpotBugs is an external plugin - external plugins need to be added as implementation dependencies before they can be applied in a precompiled script plugin:
zh_cn: Spotbugs 是一个外部插件 - 外部插件 需要添加为 implementation 依赖，然后才能在预编译的脚本插件中应用：

source: Standalone project
zh_cn: 独立项目

source: Standardizing builds with a custom Gradle distribution
zh_cn: 使用自定义 Gradle 分发标准化构建

source: Starting Plugin Development
zh_cn: 开始插件开发

source: Structuring Individual Builds
zh_cn: 构建个人构建

source: Structuring Large Projects
zh_cn: 组织大型项目

source: Structuring Software Products
zh_cn: 构建软件产品

source: Structuring a software product project with Gradle
zh_cn: 用 Gradle 构建软件产品项目

source: Tasks should define inputs and outputs to get the performance benefits of incremental build functionality.
zh_cn: 任务应定义输入和输出以获取 增量构建功能 的性能优势。

source: Terminology
zh_cn: 术语

source: Testing C++ projects
zh_cn: 测试 C++ 项目

source: Testing Java & JVM projects
zh_cn: 测试 Java & JVM 项目

source: Testing Plugins
zh_cn: 测试插件

source: Testing Swift projects
zh_cn: 测试 Swift 项目

source: Testing a Build with TestKit
zh_cn: 使用 TestKit 测试构建

source: That is, you can safely apply any plugin multiple times without side effects.
zh_cn: 也就是说，您可以安全地多次应用任何插件，而不会产生副作用。

source: The JavaPlugin symbol in the above sample refers to the JavaPlugin.
zh_cn: 上面示例中的 JavaPlugin 符号指的是 JavaPlugin。

source: The gradle.properties helps with keeping properties separate from the build script and should be explored as viable option.
zh_cn: gradle.properties 有助于将属性与构建脚本分开，应该作为可行的选项加以探索。

source: The myproject.java-conventions plugin is then applied to the buildSrc build:
zh_cn: myproject.java-conventions 插件随后应用于 buildSrc 构建：

source: The myproject.java-conventions plugin uses SpotBugs plugin to perform static code analysis.
zh_cn: myproject.java-conventions 插件使用 Spotbugs 插件来执行静态代码分析。

source: The myproject.library-conventions plugin applies the myproject.java-conventions plugin:
zh_cn: myproject.library-conventions 插件应用 myproject.java-conventions 插件：

source: The pluginManagement {} block may only appear in either the settings.gradle file, where it must be the first block in the file, or in an Initialization Script.
zh_cn: pluginManagement {} 块只可以用在 settings.gradle 文件中，其中它必须是文件中的第一个块，或者用在 Initialization Script 中。

source: The plugins {} block can currently only be used in a project’s build script and the settings.gradle file.
zh_cn: plugins {} 块当前只能用于项目的构建脚本和 settings.gradle 文件。

source: The plugins {} block does not support arbitrary code.
zh_cn: plugins {} 块不支持任意代码。

source: The plugins {} block must also be a top level statement in the buildscript.
zh_cn: plugins {} 块也必须是构建脚本中的顶级语句。

source: The apply statement with a boolean can be used to disable the default behavior of applying the plugin immediately (e.g. you want to apply it only in subprojects).
zh_cn: 带 boolean 的 apply 语句可用于禁用立即应用插件的默认行为(例如，你希望仅在 subprojects 中应用它)。

source: The Gradle plugin portal provides an interface for searching and exploring community plugins.
zh_cn: Gradle plugin portal 提供了用于搜索和探索社区插件的接口。

source: The Gradle Project has an associated ExtensionContainer object that contains all the settings and properties for the plugins that have been applied to the project.
zh_cn: Gradle 的 Project 有一个关联的 ExtensionContainer 对象，其中包含已应用于该项目的插件的所有设置和属性。

source: The Gradle Plugin Portal (gradlePluginPortal()) is added as a repository for plugin dependencies.
zh_cn: Gradle Plugin Portal(gradlePluginPortal())作为插件依赖项的存储库添加。

source: The Groovy compiler can handle the scenario of mixing Java and Groovy source files located in src/main/groovy.
zh_cn: Groovy 编译器可以处理位于 src/main/groovy 中 Java 和 Groovy 源文件混合的场景。

source: The algorithm stops searching as soon as it finds the settings file.
zh_cn: 该算法一旦找到 settings 文件就会停止搜索。

source: The answer is - you need to provide a properties file in the JAR’s META-INF/gradle-plugins directory that matches the id of your plugin, which is handled by Java Gradle Plugin Development Plugin.
zh_cn: 答案是 - 你需要在 jar 的 META-INF/gradle-plugins 目录中提供一个属性文件，该文件与插件的 id 匹配，Java Gradle Plugin Development Plugin 会帮你处理。

source: The build is configured as follows:
zh_cn: 构建配置如下：

source: The build is then included in the root project’s settings file as seen in the above snippet.
zh_cn: 然后，构建将包含在根项目的 settings 文件中，如上面的代码片段所示。

source: The build script author interacts only with the DSL defined by the extension.
zh_cn: 构建脚本作者仅与扩展定义的 DSL 交互。

source: The default behavior of the plugins {} block is to immediately resolve and apply the plugins.
zh_cn: plugins {} 块的默认行为是立即 解析并应用插件。

source: The dependency artifact coordinates (GAV) for a plugin can be different from the plugin id.
zh_cn: 插件的依赖项工件坐标(GAV)可以不同于插件 id。

source: The directory buildSrc is treated as an included build.
zh_cn: 该目录 buildSrc 被视为 included build。

source: The easiest and the recommended way to package and publish a plugin is to use the Java Gradle Plugin Development Plugin.
zh_cn: 打包和发布插件最简单也是最推荐的方法是使用 Java Gradle Plugin Development Plugin。

source: The extension object is added to the project with the name greeting.
zh_cn: 扩展对象被添加到项目中，名称为 greeting。

source: The file can either be empty or define the desired name of the project.
zh_cn: 文件可以为空，也可以定义所需的项目名称。

source: The following example shows how to tie a plugin implementation class — my.MyPlugin — defined in buildSrc to the ID "my-plugin":
zh_cn: 以下示例显示了如何将定义于 buildSrc 中的插件实现类 my.MyPlugin，绑定为 ID “my-plugin”：

source: The following example shows how you might do this when the plugin has been published to a local repository:
zh_cn: 以下示例显示了当插件已发布到本地仓库时，可以如何执行此操作：

source: The following example shows you how this works.
zh_cn: 下面的例子展示了它的工作原理。

source: The following sample contains a greeting plugin, which adds a hello task to the project.
zh_cn: 下面的示例包含一个 greeting 插件，它向项目中添加了一个 hello 任务。

source: The following sections also touch on common problems and how to avoid them.
zh_cn: 以下各节还涉及一些常见问题以及如何避免这些问题。

source: The following source tree contains Java and Kotlin source files.
zh_cn: 下面的源代码树包含 Java 和 Kotlin 源文件。

source: The following steps are typical for creating a custom Gradle distribution:
zh_cn: 以下步骤是创建自定义分发的典型步骤：

source: The form is:
zh_cn: 形式是：

source: The imperative logic is hidden in the plugin implementation.
zh_cn: 命令逻辑隐藏在插件实现中。

source: The initialization scripts come bundled with the distribution and are applied every time the build is run.
zh_cn: 初始化脚本与分发捆绑在一起，并在每次运行构建时应用。

source: The internal library subproject applies myproject.java-conventions plugin:
zh_cn: 内部库子项目应用 myproject.java-conventions 插件：

source: The last portion of the directory path usually indicates the expected language of the source files.
zh_cn: 目录路径的最后一部分通常表示源文件的预期语言。

source: The most common use case for using a plugin is to both resolve the plugin and apply it to the current project.
zh_cn: 使用插件最常见的用例是解析插件并将其应用于当前项目。

source: The name of the closure block in the build script (greeting) needs to match the extension object name.
zh_cn: 构建脚本中的闭包块(greeting)的名称需要匹配扩展对象名称。

source: The output directory for compiled source code and other artifacts (like the JAR file) is build.
zh_cn: 编译的源代码和其他产物(如 JAR 文件)的输出目录是 build。

source: The plugin can then be applied by ID as normal:
zh_cn: 然后，该插件可以通用 ID 正常应用：

source: The plugin is visible to every build script used by the build.
zh_cn: 该插件对该构建使用的每个构建脚本都可见。

source: The plugin logic provides users with sensible defaults and standards, the conventions, in a certain context.
zh_cn: 插件逻辑为用户提供了特定上下文中的合理的默认值和标准，即 convention。

source: The plugin version in this case is defined in the dependency declaration.
zh_cn: 本例中的插件版本在依赖声明中定义。

source: The plugin version is determined from the dependency version.
zh_cn: 插件版本由依赖版本决定。

source: The plugin version is loaded from gradle.properties and configured in the settings script, allowing the plugin to be added to any project without specifying the version.
zh_cn: 插件版本从 gradle.properties 加载并在 settings 脚本中进行配置，允许在不指定版本的情况下将插件添加到任何项目中。

source: The plugins DSL block configures an instance of PluginDependenciesSpec.
zh_cn: plugins DSL 块配置 PluginDependenciesSpec 的实例。

source: The plugins DSL is processed in a way which allows Gradle to determine the plugins in use very early and very quickly.
zh_cn: plugins DSL 的处理方式允许 Gradle 很早很快地确定正在使用的插件。

source: The plugins DSL provides a succinct and convenient way to declare plugin dependencies.
zh_cn: plugins DSL 提供了一种简洁方便的方式来声明插件依赖。

source: The project object is passed as a parameter, which the plugin can use to configure the project however it needs to.
zh_cn: project 对象作为参数传递，插件可以使用该参数来配置项目，它需要这样做。

source: The shared convention plugin myproject.java-conventions is implemented in an included build called build-conventions.
zh_cn: 共享的 约定插件 myproject.java-conventions 在名为 build-conventions 的 included build 中实现。

source: The traits above identify a subproject’s type.
zh_cn: 上述特征识别子项目的 类型。

source: The two public library subprojects apply myproject.library-conventions plugin.
zh_cn: 两个公共库子项目应用 myproject.library-conventions 插件。

source: The type used on the configure function in the build script (GreetingPluginExtension) needs to match the extension type.
zh_cn: 构建脚本(GreetingPluginExtension)中的 configure 函数上使用的类型需要与扩展类型匹配。

source: Then we will look at creating a standalone project.
zh_cn: 然后我们将介绍创建一个独立的项目。

source: Then, when the block is executed, the receiver of the block is the extension.
zh_cn: 然后，当执行块时，块的接收器是扩展。

source: Then, when the closure is executed, the fields on the extension object will be mapped to the variables within the closure based on the standard Groovy closure delegate feature.
zh_cn: 然后，在执行闭包时，扩展对象上的字段将根据标准 Groovy 闭包委托功能映射到闭包中的变量。

source: There are also some constraints, some of which are temporary limitations while the mechanism is still being developed and some are inherent to the new approach.
zh_cn: 还有一些限制，其中一些是暂时的限制，因为机制仍在开发中，而另一些是新方法固有的。

source: There are several places where you can put the source for the plugin.
zh_cn: 有几个地方可以放置插件的源代码。

source: There are some drawbacks to the approach.
zh_cn: 这种方法有一些缺点。

source: There are some key differences between the plugins {} block mechanism and the “traditional” apply() method mechanism.
zh_cn: plugins {} 块机制和“传统”的apply() 方法机制之间存在一些关键差异。

source: There are two general types of plugins in Gradle, binary plugins and script plugins.
zh_cn: Gradle 中有两种常见的插件，binary (二进制) 插件和 script (脚本) 插件。

source: There are two most common uses of cross-configuration that can be better modelled using convention plugins:
zh_cn: 跨项目配置有两个最常见的用例，相比使用约定插件更好：

source: They are typically used within a build although they can be externalized and accessed from a remote location.
zh_cn: 它们通常在构建内使用，尽管它们可以外部化并从远程位置访问。

source: They cannot have the same name as a built-in plugin id.
zh_cn: 它们不能与内置插件 id 具有相同的名称。

source: They cannot start with org.gradle.
zh_cn: 它们无法以 org.gradle 开头。

source: Things to note
zh_cn: 注意事项

source: This allows Gradle to do smart things such as:
zh_cn: 这让 Gradle 可以做一些聪明的事情，比如：

source: This allows plugin versions to be taken from gradle.properties, or loaded via another mechanism.
zh_cn: 这允许从 gradle.properties 中取出插件版本，或通过另一种机制加载。

source: This can be achieved in a number of ways:
zh_cn: 这可以通过多种方式实现：

source: This chapter aims to serve as an introduction to plugins and Gradle and the role they play.
zh_cn: 本章旨在介绍插件和 Gradle 以及他们发挥的角色。

source: This class does not strictly need to be imported as the org.gradle.api.plugins package is automatically imported in all build scripts (see Default imports).
zh_cn: 该类不需要严格地导入，因为 org.gradle.api.plugins 包在所有构建脚本中自动导入(请参阅 Default imports)。

source: This ensures that the precompiled script plugins won’t be silently ignored.
zh_cn: 这确保了预编译的脚本插件不会被静默忽略。

source: This example has it receiving the Project type as a type parameter.
zh_cn: 本例将 Project 类型作为类型参数接收。

source: This has the benefit that the plugin is automatically compiled and included in the classpath of the build script without you having to do anything.
zh_cn: 这样做的好处是，插件会自动编译并包含在构建脚本的类路径中，而无需执行任何操作。

source: This helps to avoid collisions and provides a way to group plugins with similar ownership.
zh_cn: 这有助于避免冲突，并提供了一种将具有类似所有权的插件分组的方法。

source: This is equivalent to applying X-conventions plugin directly to a subproject.
zh_cn: 这相当于将 X-conventions 插件直接应用于子项目。

source: This is the project structure:
zh_cn: 这是项目结构：

source: This kind of lazy evaluation is a key benefit of accepting any value when setting a file property, then resolving that value when reading the property.
zh_cn: 这种延迟计算的一个关键好处是，在设置文件属性时接受任何值，然后在读取属性时解析该值。

source: This limitation will be lifted in a future version of Gradle.
zh_cn: 这一限制将在未来版本的 Gradle 中取消。

source: This marker needs to have a dependency on the actual plugin implementation.
zh_cn: 该标记需要依赖于实际的插件实现。

source: This object then becomes available as a project property with the same name as the extension object.
zh_cn: 然后，该对象将作为与扩展对象同名的项目属性可用。

source: This page lays out the best practices that lead to readable, maintainable projects.
zh_cn: 本页列出了写出可读、可维护项目的最佳实践。

source: This plugin will automatically apply the Java Plugin, add the gradleApi() dependency to the api configuration, generate the required plugin descriptors in the resulting JAR file and configure the Plugin Marker Artifact to be used when publishing.
zh_cn: 该插件将自动应用 Java Plugin，将 gradleApi() 依赖项添加到 api 配置中，在生成的 JAR 文件中生成所需的插件描述符，并配置发布时要使用的 Plugin Marker Artifact。

source: This project is simply a Java project that produces a JAR containing the plugin classes.
zh_cn: 这个项目只是一个 Java 项目，它生成一个包含插件类的 JAR。

source: This project produces and publishes a JAR which you can then use in multiple builds and share with others.
zh_cn: 该项目生成并发布一个 JAR，然后你可以在多个构建中使用它，并可以与其他人共享。

source: This recommendation applies to single project builds as well as multi-project builds.
zh_cn: 该建议适用于单项目构建以及多项目构建。

source: This requires that plugins be specified in a way that Gradle can easily and quickly extract, before executing the rest of the build script.
zh_cn: 这要求在执行构建脚本的其余部分之前，以 Gradle 可以轻松快速提取的方式指定插件。

source: This sample does not have any project source code and only lays out a hypothetical project structure where two library subprojects depend on a shared internal subproject.
zh_cn: 此示例没有任何项目源代码，只列出了一个假设的项目结构，其中两个库子项目依赖于一个共享的内部子项目。

source: This sample shows how convention plugins can be shared and applied to both the production code and the build logic code in buildSrc.
zh_cn: 此示例显示了 convention plugins (约定插件) 如何共享，并可应用于生产代码和 buildSrc 中的构建逻辑代码。

source: This sample shows how build logic in a multi-project build can be organized into reusable plugins.
zh_cn: 此示例显示了如何将多项目构建中的构建逻辑，组织为可重用插件。

source: This script plugin simply applies the Java Library and Checkstyle Plugins and configures them.
zh_cn: 这个脚本插件只应用 Java 库和 Checkstyle 插件并对它们进行配置。

source: This site provides the ability to search for and gather information about plugins contributed by the Gradle community.
zh_cn: 该网站提供了搜索和收集 Gradle 社区提供的插件信息的能力。

source: This tells Gradle to first look in the Maven repository at ../maven-repo when resolving plugins and then to check the Gradle Plugin Portal if the plugins are not found in the Maven repository.
zh_cn: 这告诉 Gradle 在解析插件时首先在位于 ../maven-repo 的 Maven 仓库中查找，如果在该 Maven 仓库中没有找到插件，则到 Gradle Plugin Portal 中查找。

source: This tells Gradle to use the specified plugin implementation artifact instead of using its built-in default mapping from plugin ID to Maven/Ivy coordinates.
zh_cn: 这告诉 Gradle 使用指定的插件实现库，而不是使用插件 ID 到 Maven/Ivy 坐标的内置默认映射。

source: This use case can be modelled using outgoing configuration variants.
zh_cn: 该用例可以使用 传出配置变体 来实现。

source: This way of adding plugins to a project is much more than a more convenient syntax.
zh_cn: 这种向项目中添加插件的方式远不止是一种更方便的语法。

source: Thus, when making small incremental changes, the --no-rebuild command-line option is often helpful to get faster feedback.
zh_cn: 因此，在进行小的增量更改时，--no-rebuild 命令行选项 通常有助于获得更快的反馈。

source: To add resolution rules, use the resolutionStrategy {} inside the pluginManagement {} block:
zh_cn: 要添加解析规则，请在 pluginManagement {} 块中使用 resolutionStrategy {}：

source: To apply a community plugin from the portal, the fully qualified plugin id must be used:
zh_cn: 要从 portal 应用社区插件，必须使用完全限定的插件 id：

source: To apply a core plugin, the short name can be used:
zh_cn: 要应用核心插件，可以使用以下简称：

source: To apply a precompiled script plugin, you need to know its ID which is derived from the plugin script’s filename (minus the .gradle.kts extension) and its (optional) package declaration.
zh_cn: 要应用预编译脚本插件，需要知道其 id，该 id 来自插件脚本的文件名(减去 .gradle.kts 扩展名)及其(可选的)包声明。

source: To apply a precompiled script plugin, you need to know its ID which is derived from the plugin script’s filename (minus the .gradle extension).
zh_cn: 要应用预编译脚本插件，需要知道其 id，该 id 来自插件脚本的文件名(减去 .gradle 扩展名)。

source: To create a Gradle plugin, you need to write a class that implements the Plugin interface.
zh_cn: 要创建 Gradle 插件，需要编写一个实现 Plugin 接口的类。

source: To demonstrate how you can implement and use a precompiled script plugin, let’s walk through an example based on a buildSrc project.
zh_cn: 为了演示如何实现和使用预编译脚本插件，让我们浏览一个基于 buildSrc 项目的示例。

source: To do so, Gradle will look for a Plugin Marker Artifact with the coordinates plugin.id:plugin.id.gradle.plugin:plugin.version.
zh_cn: 为此，Gradle 将寻找带有坐标 plugin.id:plugin.id.gradle.plugin:plugin.version 的插件标记库。

source: To specify custom plugin repositories, use the repositories {} block inside pluginManagement {}:
zh_cn: 要指定自定义插件仓库，请使用 pluginManagement {} 中的 repositories {} 块：

source: To use a plugin in a build script, you need to configure the repository in pluginManagement {} block of the project’s settings file.
zh_cn: 要在构建脚本中使用插件，需要在项目 settings 文件的 pluginManagement {} 块中配置仓库。

source: To use the build logic encapsulated in a plugin, Gradle needs to perform two steps.
zh_cn: 要使用封装在插件中的构建逻辑，Gradle 需要执行两个步骤。

source: Toolchains for Java projects
zh_cn: Java 项目的工具链

source: Transforming Artifacts
zh_cn: 转换产物

source: Troubleshooting
zh_cn: 故障排除

source: Troubleshooting Builds
zh_cn: 构建的故障排除

source: Try to stick to the default conventions as much as possible except if you need to adapt to the layout of a legacy project.
zh_cn: 尽量坚持默认约定，除非需要适应遗留项目的布局。

source: Tweaking Project Structure
zh_cn: 调整项目结构

source: Two out of three projects are more than just Java projects - they are libraries that we perhaps want to publish to an external repository.
zh_cn: 三个项目中的两个不仅仅是 Java 项目 - 它们还是我们想要发布到外部存储库的库。

source: Types of plugins
zh_cn: 插件类型

source: Understanding Configuration and Execution
zh_cn: 理解配置和执行

source: Understanding Gradle Module Metadata
zh_cn: 理解 Gradle 模块元数据

source: Understanding Library and Application Differences
zh_cn: 理解库和应用的差异

source: Understanding Resolution
zh_cn: 理解解析

source: Understanding Variant Selection
zh_cn: 理解变体选择

source: Understanding the Build Lifecycle
zh_cn: 理解构建生命周期

source: Understanding the Impact
zh_cn: 了解影响

source: Upgrading Gradle
zh_cn: 升级 Gradle

source: Upgrading Versions
zh_cn: 升级版本
